In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("stores.csv")

In [7]:
cols = ['Sales',"Quantity","Discount","Profit"]

In [9]:
data[cols]

         Sales  Quantity  Discount    Profit
0     261.9600         2      0.00   41.9136
1     731.9400         3      0.00  219.5820
2      14.6200         2      0.00    6.8714
3     957.5775         5      0.45 -383.0310
4      22.3680         2      0.20    2.5164
...        ...       ...       ...       ...
9989   25.2480         3      0.20    4.1028
9990   91.9600         2      0.00   15.6332
9991  258.5760         2      0.20   19.3932
9992   29.6000         4      0.00   13.3200
9993  243.1600         2      0.00   72.9480

[9994 rows x 4 columns]

In [10]:
def Sum(C):
    return C.sum()

In [11]:
data[cols].apply(Sum,axis=0)

Sales       2.297201e+06
Quantity    3.787300e+04
Discount    1.561090e+03
Profit      2.863970e+05
dtype: float64

In [12]:
data[cols].apply(Sum,axis=1)

0       305.8736
1       954.5220
2        23.4914
3       579.9965
4        27.0844
          ...
9989     32.5508
9990    109.5932
9991    280.1692
9992     46.9200
9993    318.1080
Length: 9994, dtype: float64

In [13]:
data.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

if the ship mode is first class then we incur an additional cost of 200 and this should be subtracted from the sales

apply() method in a dataframe

In [14]:
def correct(row):
    if row['Ship Mode'] == "First Class":
        return row['Sales'] - 200
    else:
        return row['Sales']

In [15]:
data.apply(correct,axis=1) ### axis=1, mean we are iterating over each row

0       261.9600
1       731.9400
2        14.6200
3       957.5775
4        22.3680
          ...
9989     25.2480
9990     91.9600
9991    258.5760
9992     29.6000
9993    243.1600
Length: 9994, dtype: float64